In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [15]:
# 날짜형 데이터 date_range, periods 옵션으로 6일간이라고 지정.
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117
2013-01-05  1.420039  0.216454 -0.101717  2.033703
2013-01-06 -0.031534  2.539085  0.673029  0.169224

In [17]:
df.head(3)

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[ 0.79363328,  0.7667799 , -0.98892044, -1.55251929],
       [ 0.11717405, -1.63829466,  0.18229996,  1.72284568],
       [ 0.79868667,  1.64306053, -1.72114446,  1.18619204],
       [-0.24681654,  0.04296292, -0.65056957, -0.53711721],
       [ 1.42003917,  0.21645426, -0.10171736,  2.03370263],
       [-0.03153441,  2.53908483,  0.67302898,  0.16922423]])

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.475197  0.595008 -0.434504  0.503721
std    0.633251  1.438266  0.863404  1.394004
min   -0.246817 -1.638295 -1.721144 -1.552519
25%    0.005643  0.086336 -0.904333 -0.360532
50%    0.455404  0.491617 -0.376143  0.677708
75%    0.797423  1.423990  0.111296  1.588682
max    1.420039  2.539085  0.673029  2.033703

In [25]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06 -0.031534  2.539085  0.673029  0.169224
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-05  1.420039  0.216454 -0.101717  2.033703
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117
2013-01-02  0.117174 -1.638295  0.182300  1.722846

In [26]:
df

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117
2013-01-05  1.420039  0.216454 -0.101717  2.033703
2013-01-06 -0.031534  2.539085  0.673029  0.169224

In [27]:
df['A']

2013-01-01    0.793633
2013-01-02    0.117174
2013-01-03    0.798687
2013-01-04   -0.246817
2013-01-05    1.420039
2013-01-06   -0.031534
Freq: D, Name: A, dtype: float64

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192

In [29]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117

In [30]:
df.loc[dates[0]]

A    0.793633
B    0.766780
C   -0.988920
D   -1.552519
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.793633  0.766780
2013-01-02  0.117174 -1.638295
2013-01-03  0.798687  1.643061
2013-01-04 -0.246817  0.042963
2013-01-05  1.420039  0.216454
2013-01-06 -0.031534  2.539085

In [32]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.117174 -1.638295
2013-01-03  0.798687  1.643061
2013-01-04 -0.246817  0.042963

In [33]:
df.loc['20130102', ['A', 'B']]

A    0.117174
B   -1.638295
Name: 2013-01-02 00:00:00, dtype: float64

In [34]:
df.loc[dates[0], 'A']

0.79363327539657891

In [35]:
df.iloc[3]

A   -0.246817
B    0.042963
C   -0.650570
D   -0.537117
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
# 3번째부터 4번째 까지의 행과 0번째 부터 1번째 까지의 열의 데이터를 가져온다.
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.246817  0.042963
2013-01-05  1.420039  0.216454

In [37]:
# 콤마로 행이나 열을 지정해서 데이터를 가져올 수 있다.
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.117174  0.182300
2013-01-03  0.798687 -1.721144
2013-01-05  1.420039 -0.101717

In [40]:
# 전체를 의미하게 하고 싶을 때는 콜론(:)을 사용하면 된다.
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192

In [41]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.766780 -0.988920
2013-01-02 -1.638295  0.182300
2013-01-03  1.643061 -1.721144
2013-01-04  0.042963 -0.650570
2013-01-05  0.216454 -0.101717
2013-01-06  2.539085  0.673029

In [42]:
df

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117
2013-01-05  1.420039  0.216454 -0.101717  2.033703
2013-01-06 -0.031534  2.539085  0.673029  0.169224

In [43]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-05  1.420039  0.216454 -0.101717  2.033703

In [44]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.793633  0.766780       NaN       NaN
2013-01-02  0.117174       NaN  0.182300  1.722846
2013-01-03  0.798687  1.643061       NaN  1.186192
2013-01-04       NaN  0.042963       NaN       NaN
2013-01-05  1.420039  0.216454       NaN  2.033703
2013-01-06       NaN  2.539085  0.673029  0.169224

In [45]:
df2 = df.copy()

In [47]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.793633  0.766780 -0.988920 -1.552519    one
2013-01-02  0.117174 -1.638295  0.182300  1.722846    one
2013-01-03  0.798687  1.643061 -1.721144  1.186192    two
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117  three
2013-01-05  1.420039  0.216454 -0.101717  2.033703   four
2013-01-06 -0.031534  2.539085  0.673029  0.169224  three

In [48]:
df2['E'].isin(['two', 'three'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: E, dtype: bool

In [49]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.798687  1.643061 -1.721144  1.186192   two
2013-01-05  1.420039  0.216454 -0.101717  2.033703  four

In [50]:
df

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.117174 -1.638295  0.182300  1.722846
2013-01-03  0.798687  1.643061 -1.721144  1.186192
2013-01-04 -0.246817  0.042963 -0.650570 -0.537117
2013-01-05  1.420039  0.216454 -0.101717  2.033703
2013-01-06 -0.031534  2.539085  0.673029  0.169224

In [51]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.793633  0.766780 -0.988920 -1.552519
2013-01-02  0.910807 -0.871515 -0.806620  0.170326
2013-01-03  1.709494  0.771546 -2.527765  1.356518
2013-01-04  1.462677  0.814509 -3.178335  0.819401
2013-01-05  2.882717  1.030963 -3.280052  2.853104
2013-01-06  2.851182  3.570048 -2.607023  3.022328

In [52]:
df.apply(lambda x: x.max() - x.min())

A    1.666856
B    4.177379
C    2.394173
D    3.586222
dtype: float64

In [54]:
df.apply(lambda x: x.max())

A    1.420039
B    2.539085
C    0.673029
D    2.033703
dtype: float64